added mermaid diagrams
